<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"20c10056b1bcdb186be9d114524284c03a0cd838925e56151cd8cfc15c0a61a3","plan_job_ref":"Job .github/workflows/_test-tf.yaml #192 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361135975","plan_out_hash":"d6f1900ac4810fcd346c2bc7923e46a4836fde25843851561769a3805d37709c","plan_hash":"9e8a611591e30463be7554ca397e2a0185a8dd7b9e85b48169877b0508c4144c","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #192](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361135975)